# DefaultButton Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TaskDialog..::..DefaultButton Property
TaskDialog Class See Also
---
The default button for the dialog.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public TaskDialogResult DefaultButton { get; set; }
```

Visual Basic
---
```text
Public Property DefaultButton As TaskDialogResult
	Get
	Set
```

Visual C++
---
```text
public:
property TaskDialogResult DefaultButton {
	TaskDialogResult get ();
	void set (TaskDialogResult value);
}
```

# Remarks
If DefaultButton is TaskDialogResult.None or its value does not correspond to any CommonButton or CommandLink in the dialog, then the first button in the dialog will be the default.
# See Also
TaskDialog Class
Autodesk.Revit.UI Namespace